// հին  ձև
//"click"-ից հետո թաքցնել բոլոր Էլեմենտները
// $("button").click(function () {
// 	$("p").hide();
// });
// նոր ձև
$(function () {
	$("button").on("click", "", {
		author: "Edgar"
	}, function (e) {
		console.log('e', e)
		$("p").hide();
	});
});



//on("click", [, selector][, data], function (e){})
//  jQuery 1.7 տարբերակից սկսած իրադարձությունների մշակման համար օգտագործվում է on() մեթոդը .click(), կամ մնացածների փոխարեն։
//  on() մեթոդին հարկավոր է փոխանցել 2 արգումենտ(ունի 4 արգումենտ)
//  on(event,[,selector][,data],function(e))
//  1․event	- իրադարձության անունը օրինակ "click"
//  2․selector - հնարավորություն է տալիս 2-րդ անգամ ֆիլտրել ընտրված կոլեկցիան, 
//  3․data 	- ֆունկցիային հավելյալ ինֆորմացիա փողանցելու համար(օր․օբյեկտ) փոխանցվում է event-ի հետ միասաին
//  4․function - որը կկատարվի իրադարձության ֆիքման ժամանակ 
//  5.e		- event օբյեկտ 