$(function(){
// Սկզբից սարքում ենք jQuery հավաքածու/կալեկցիա <div> Էլեմենտներից, տալիս ենք css կանոններ
// հետո սարքում ենք <p> թեգ և ավելացնում ենք այն ընտրված 
//  jQuery հավաքածուին (ոչ թե  DOM-ին!), վերջում 
// տալիս ենք css կանոններ
	$( "div" )
	.css( "border", "2px solid red" )
	.add( "p" )
	.css( "background", "yellow" ); // div, p = background:yellow;

  	/*Սելեքտորը գտնում է 3-րդ էլեմենտը,միայն այդ էլեմենտի վրա կանչվում է .nextAll() մեթոդը, որը դրանից հետո եկող 3 և 4 li-ը ավելացնում է ՍՏԵՔԻՆ.Վերջապես, .addBack() մեթոդի կանչը միավորում է այս 2 հավաքածուն, սարքելով JQuery օբյեկտ, որը մատնանշում է այդ 3 էլեմենտները: 
  	 Հետո այդ 3-ից առաջ ավելացնում ենք' Акция!' բառը*/
  	$( "li.third-item" ).nextAll().addBack()
  	.addClass('bgRed').prepend(' Акция!');
  	
  	// Գտնում է 'mexr' բառը li-րի մեջ և ավելացնում է վերջից 'Tnakan' բառը։
  	$("li:contains('mexr')").append(' Tnakan');
})


